<?php

echo json_encode(array (
  20200501 =>
  array (
    0 => '연근조림',
    1 => '매콤멸치견과류볶음',
    2 => '간장새송이버섯볶음',
    3 => '간장가지볶음',
    4 => '메추리알조림',
    5 => '새우젓애호박볶음',
    6 => '매콤닭갈비',
    7 => '소고기미역국',
  ),
  20200502 =>
  array (
    0 => '연근조림',
    1 => '매콤멸치견과류볶음',
    2 => '간장새송이버섯볶음',
    3 => '간장가지볶음',
    4 => '메추리알조림',
    5 => '새우젓애호박볶음',
  ),
  20200503 => '0',
  20200504 => '0',
  20200505 => '0',
  20200506 => '0',
  20200507 =>
  array (
    0 => '두부조림',
    1 => '매콤멸치볶음',
    2 => '소세지야채볶음',
    3 => '계란말이',
    4 => '간장미역줄기볶음',
    5 => '땅콩조림',
  ),
  20200508 =>
  array (
    0 => '간장가지볶음',
    1 => '간장어묵볶음',
    2 => '우엉조림',
    3 => '간장고사리볶음',
    4 => '무나물',
    5 => '새우젓애호박볶음',
    6 => '소불고기',
    7 => '황태국',
  ),
  20200509 =>
  array (
    0 => '간장느타리버섯볶음',
    1 => '간장미역줄기볶음',
    2 => '간장어묵볶음',
    3 => '시금치무침',
    4 => '땅콩조림',
    5 => '건파래무침',
  ),
  20200510 => '0',
  20200511 => '0',
  20200512 =>
  array (
    0 => '땅콩조림',
    1 => '마파두부',
    2 => '연근조림',
    3 => '매콤멸치볶음',
    4 => '매콤진미채무침',
    5 => '간장명엽채볶음',
  ),
  20200513 =>
  array (
    0 => '계란말이',
    1 => '매콤건새우볶음',
    2 => '검은콩조림',
    3 => '매콤진미채무침',
    4 => '간장오징어실채볶음',
    5 => '간장멸치볶음',
    6 => '매콤돼지불고기',
    7 => '근대된장국',
  ),
  20200514 =>
  array (
    0 => '깻잎무침',
    1 => '간장느타리버섯볶음',
    2 => '간장오징어실채볶음',
    3 => '매콤진미채무침',
    4 => '간장멸치볶음',
    5 => '메추리알조림',
  ),
  20200515 =>
  array (
    0 => '메추리알조림',
    1 => '간장오징어실채볶음',
    2 => '우엉조림',
    3 => '매콤건새우볶음',
    4 => '콩나물무침',
    5 => '간장미역줄기볶음',
    6 => '버터바싹불고기',
    7 => '소고기미역국',
  ),
  20200516 =>
  array (
    0 => '새우젓애호박볶음',
    1 => '시금치무침',
    2 => '콩나물무침',
    3 => '간장미역줄기볶음',
    4 => '무생채',
    5 => '두부매콤조림',
  ),
  20200517 => '0',
  20200518 => '0',
  20200519 =>
  array (
    0 => '마파두부',
    1 => '계란말이',
    2 => '연근조림',
    3 => '간장어묵볶음',
    4 => '땅콩조림',
    5 => '간장멸치견과류볶음',
  ),
  20200520 =>
  array (
    0 => '소세지야채볶음',
    1 => '간장어묵볶음',
    2 => '간장멸치볶음',
    3 => '두부매콤조림',
    4 => '우엉조림',
    5 => '감자베이컨볶음',
    6 => '매콤닭갈비',
    7 => '황태국',
  ),
  20200521 =>
  array (
    0 => '오이부추무침',
    1 => '간장고사리볶음',
    2 => '매콤어묵볶음',
    3 => '마늘쫑베이컨볶음',
    4 => '무나물',
    5 => '소세지야채볶음',
  ),
  20200522 =>
  array (
    0 => '간장가지볶음',
    1 => '간장느타리버섯볶음',
    2 => '매콤건새우볶음',
    3 => '매콤어묵볶음',
    4 => '시금치무침',
    5 => '들깨무나물',
    6 => '소불고기',
    7 => '근대된장국',
  ),
  20200523 =>
  array (
    0 => '간장오징어실채볶음',
    1 => '두부조림',
    2 => '간장명엽채볶음',
    3 => '간장멸치견과류볶음',
    4 => '마늘쫑베이컨볶음',
    5 => '새콤무생채',
  ),
  20200524 => '0',
  20200525 => '0',
  20200526 =>
  array (
    0 => '매콤멸치볶음',
    1 => '두부매콤조림',
    2 => '매콤진미채무침',
    3 => '소세지야채볶음',
    4 => '감자베이컨볶음',
    5 => '마늘쫑베이컨볶음',
  ),
  20200527 =>
  array (
    0 => '감자베이컨볶음',
    1 => '계란말이',
    2 => '매콤멸치견과류볶음',
    3 => '매콤어묵볶음',
    4 => '마늘쫑베이컨볶음',
    5 => '두부매콤조림',
    6 => '매콤돼지불고기',
    7 => '소고기미역국',
  ),
  20200528 =>
  array (
    0 => '검은콩조림',
    1 => '아삭이된장무침',
    2 => '무생채',
    3 => '간장새송이버섯볶음',
    4 => '간장가지볶음',
    5 => '오이부추무침',
  ),
  20200529 =>
  array (
    0 => '건파래무침',
    1 => '들깨무나물',
    2 => '간장고사리볶음',
    3 => '매콤어묵볶음',
    4 => '간장새송이버섯볶음',
    5 => '간장멸치볶음',
    6 => '버터바싹불고기',
    7 => '황태국',
  ),
  20200530 =>
  array (
    0 => '새콤무생채',
    1 => '깻잎무침',
    2 => '간장새송이버섯볶음',
    3 => '새우젓애호박복음',
    4 => '매콤멸치견과류볶음',
    5 => '콩나물무침',
  ),
  20200531 => '0',
));