<?php
/**
 * 수동으로 여러개의 키워드를 입력해서 수집
 */
try {
    ini_set("display_errors", 1);
    ini_set('max_execution_time', '0');
    ini_set('memory_limit', '-1');        
    
    $KEYWORD = '미용가위';
    $REL_KEYWORD = '애견강아지가위,애견숱가위,애견미용가위,애견머리가위,애견헤어가위,애견커트가위,애견장가위,애견숯가위,애견앞머리가위,애견컷트가위,애견일본가위,애견일제가위,애견숱치는가위,애견미용실가위,애견이발소가위,애견셀프가위,애견가정용가위,애견어린이가위,애견틴닝가위,애견유아가위,애견안전가위,애견스트록가위,애견블런트가위,강아지애견가위,강아지숱가위,강아지미용가위,강아지머리가위,강아지헤어가위,강아지커트가위,강아지장가위,강아지숯가위,강아지앞머리가위,강아지컷트가위,강아지일본가위,강아지일제가위,강아지숱치는가위,강아지미용실가위,강아지이발소가위,강아지셀프가위,강아지가정용가위,강아지어린이가위,강아지틴닝가위,강아지유아가위,강아지안전가위,강아지스트록가위,강아지블런트가위,숱애견가위,숱강아지가위,숱미용가위,숱머리가위,숱헤어가위,숱커트가위,숱장가위,숱숯가위,숱앞머리가위,숱컷트가위,숱일본가위,숱일제가위,숱숱치는가위,숱미용실가위,숱이발소가위,숱셀프가위,숱가정용가위,숱어린이가위,숱틴닝가위,숱유아가위,숱안전가위,숱스트록가위,숱블런트가위,미용애견가위,미용강아지가위,미용숱가위,미용머리가위,미용헤어가위,미용커트가위,미용장가위,미용숯가위,미용앞머리가위,미용컷트가위,미용일본가위,미용일제가위,미용숱치는가위,미용미용실가위,미용이발소가위,미용셀프가위,미용가정용가위,미용어린이가위,미용틴닝가위,미용유아가위,미용안전가위,미용스트록가위,미용블런트가위,머리애견가위,머리강아지가위,머리숱가위,머리미용가위,머리헤어가위,머리커트가위,머리장가위,머리숯가위,머리앞머리가위,머리컷트가위,머리일본가위,머리일제가위,머리숱치는가위,머리미용실가위,머리이발소가위,머리셀프가위,머리가정용가위,머리어린이가위,머리틴닝가위,머리유아가위,머리안전가위,머리스트록가위,머리블런트가위,헤어애견가위,헤어강아지가위,헤어숱가위,헤어미용가위,헤어머리가위,헤어커트가위,헤어장가위,헤어숯가위,헤어앞머리가위,헤어컷트가위,헤어일본가위,헤어일제가위,헤어숱치는가위,헤어미용실가위,헤어이발소가위,헤어셀프가위,헤어가정용가위,헤어어린이가위,헤어틴닝가위,헤어유아가위,헤어안전가위,헤어스트록가위,헤어블런트가위,커트애견가위,커트강아지가위,커트숱가위,커트미용가위,커트머리가위,커트헤어가위,커트장가위,커트숯가위,커트앞머리가위,커트컷트가위,커트일본가위,커트일제가위,커트숱치는가위,커트미용실가위,커트이발소가위,커트셀프가위,커트가정용가위,커트어린이가위,커트틴닝가위,커트유아가위,커트안전가위,커트스트록가위,커트블런트가위,장애견가위,장강아지가위,장숱가위,장미용가위,장머리가위,장헤어가위,장커트가위,장숯가위,장앞머리가위,장컷트가위,장일본가위,장일제가위,장숱치는가위,장미용실가위,장이발소가위,장셀프가위,장가정용가위,장어린이가위,장틴닝가위,장유아가위,장안전가위,장스트록가위,장블런트가위,숯애견가위,숯강아지가위,숯숱가위,숯미용가위,숯머리가위,숯헤어가위,숯커트가위,숯장가위,숯앞머리가위,숯컷트가위,숯일본가위,숯일제가위,숯숱치는가위,숯미용실가위,숯이발소가위,숯셀프가위,숯가정용가위,숯어린이가위,숯틴닝가위,숯유아가위,숯안전가위,숯스트록가위,숯블런트가위,앞머리애견가위,앞머리강아지가위,앞머리숱가위,앞머리미용가위,앞머리머리가위,앞머리헤어가위,앞머리커트가위,앞머리장가위,앞머리숯가위,앞머리컷트가위,앞머리일본가위,앞머리일제가위,앞머리숱치는가위,앞머리미용실가위,앞머리이발소가위,앞머리셀프가위,앞머리가정용가위,앞머리어린이가위,앞머리틴닝가위,앞머리유아가위,앞머리안전가위,앞머리스트록가위,앞머리블런트가위,컷트애견가위,컷트강아지가위,컷트숱가위,컷트미용가위,컷트머리가위,컷트헤어가위,컷트커트가위,컷트장가위,컷트숯가위,컷트앞머리가위,컷트일본가위,컷트일제가위,컷트숱치는가위,컷트미용실가위,컷트이발소가위,컷트셀프가위,컷트가정용가위,컷트어린이가위,컷트틴닝가위,컷트유아가위,컷트안전가위,컷트스트록가위,컷트블런트가위,일본애견가위,일본강아지가위,일본숱가위,일본미용가위,일본머리가위,일본헤어가위,일본커트가위,일본장가위,일본숯가위,일본앞머리가위,일본컷트가위,일본일제가위,일본숱치는가위,일본미용실가위,일본이발소가위,일본셀프가위,일본가정용가위,일본어린이가위,일본틴닝가위,일본유아가위,일본안전가위,일본스트록가위,일본블런트가위,일제애견가위,일제강아지가위,일제숱가위,일제미용가위,일제머리가위,일제헤어가위,일제커트가위,일제장가위,일제숯가위,일제앞머리가위,일제컷트가위,일제일본가위,일제숱치는가위,일제미용실가위,일제이발소가위,일제셀프가위,일제가정용가위,일제어린이가위,일제틴닝가위,일제유아가위,일제안전가위,일제스트록가위,일제블런트가위,숱치는애견가위,숱치는강아지가위,숱치는숱가위,숱치는미용가위,숱치는머리가위,숱치는헤어가위,숱치는커트가위,숱치는장가위,숱치는숯가위,숱치는앞머리가위,숱치는컷트가위,숱치는일본가위,숱치는일제가위,숱치는미용실가위,숱치는이발소가위,숱치는셀프가위,숱치는가정용가위,숱치는어린이가위,숱치는틴닝가위,숱치는유아가위,숱치는안전가위,숱치는스트록가위,숱치는블런트가위,미용실애견가위,미용실강아지가위,미용실숱가위,미용실미용가위,미용실머리가위,미용실헤어가위,미용실커트가위,미용실장가위,미용실숯가위,미용실앞머리가위,미용실컷트가위,미용실일본가위,미용실일제가위,미용실숱치는가위,미용실이발소가위,미용실셀프가위,미용실가정용가위,미용실어린이가위,미용실틴닝가위,미용실유아가위,미용실안전가위,미용실스트록가위,미용실블런트가위,이발소애견가위,이발소강아지가위,이발소숱가위,이발소미용가위,이발소머리가위,이발소헤어가위,이발소커트가위,이발소장가위,이발소숯가위,이발소앞머리가위,이발소컷트가위,이발소일본가위,이발소일제가위,이발소숱치는가위,이발소미용실가위,이발소셀프가위,이발소가정용가위,이발소어린이가위,이발소틴닝가위,이발소유아가위,이발소안전가위,이발소스트록가위,이발소블런트가위,셀프애견가위,셀프강아지가위,셀프숱가위,셀프미용가위,셀프머리가위,셀프헤어가위,셀프커트가위,셀프장가위,셀프숯가위,셀프앞머리가위,셀프컷트가위,셀프일본가위,셀프일제가위,셀프숱치는가위,셀프미용실가위,셀프이발소가위,셀프가정용가위,셀프어린이가위,셀프틴닝가위,셀프유아가위,셀프안전가위,셀프스트록가위,셀프블런트가위,가정용애견가위,가정용강아지가위,가정용숱가위,가정용미용가위,가정용머리가위,가정용헤어가위,가정용커트가위,가정용장가위,가정용숯가위,가정용앞머리가위,가정용컷트가위,가정용일본가위,가정용일제가위,가정용숱치는가위,가정용미용실가위,가정용이발소가위,가정용셀프가위,가정용어린이가위,가정용틴닝가위,가정용유아가위,가정용안전가위,가정용스트록가위,가정용블런트가위,어린이애견가위,어린이강아지가위,어린이숱가위,어린이미용가위,어린이머리가위,어린이헤어가위,어린이커트가위,어린이장가위,어린이숯가위,어린이앞머리가위,어린이컷트가위,어린이일본가위,어린이일제가위,어린이숱치는가위,어린이미용실가위,어린이이발소가위,어린이셀프가위,어린이가정용가위,어린이틴닝가위,어린이유아가위,어린이안전가위,어린이스트록가위,어린이블런트가위,틴닝애견가위,틴닝강아지가위,틴닝숱가위,틴닝미용가위,틴닝머리가위,틴닝헤어가위,틴닝커트가위,틴닝장가위,틴닝숯가위,틴닝앞머리가위,틴닝컷트가위,틴닝일본가위,틴닝일제가위,틴닝숱치는가위,틴닝미용실가위,틴닝이발소가위,틴닝셀프가위,틴닝가정용가위,틴닝어린이가위,틴닝유아가위,틴닝안전가위,틴닝스트록가위,틴닝블런트가위,유아애견가위,유아강아지가위,유아숱가위,유아미용가위,유아머리가위,유아헤어가위,유아커트가위,유아장가위,유아숯가위,유아앞머리가위,유아컷트가위,유아일본가위,유아일제가위,유아숱치는가위,유아미용실가위,유아이발소가위,유아셀프가위,유아가정용가위,유아어린이가위,유아틴닝가위,유아안전가위,유아스트록가위,유아블런트가위,안전애견가위,안전강아지가위,안전숱가위,안전미용가위,안전머리가위,안전헤어가위,안전커트가위,안전장가위,안전숯가위,안전앞머리가위,안전컷트가위,안전일본가위,안전일제가위,안전숱치는가위,안전미용실가위,안전이발소가위,안전셀프가위,안전가정용가위,안전어린이가위,안전틴닝가위,안전유아가위,안전스트록가위,안전블런트가위,스트록애견가위,스트록강아지가위,스트록숱가위,스트록미용가위,스트록머리가위,스트록헤어가위,스트록커트가위,스트록장가위,스트록숯가위,스트록앞머리가위,스트록컷트가위,스트록일본가위,스트록일제가위,스트록숱치는가위,스트록미용실가위,스트록이발소가위,스트록셀프가위,스트록가정용가위,스트록어린이가위,스트록틴닝가위,스트록유아가위,스트록안전가위,스트록블런트가위,블런트애견가위,블런트강아지가위,블런트숱가위,블런트미용가위,블런트머리가위,블런트헤어가위,블런트커트가위,블런트장가위,블런트숯가위,블런트앞머리가위,블런트컷트가위,블런트일본가위,블런트일제가위,블런트숱치는가위,블런트미용실가위,블런트이발소가위,블런트셀프가위,블런트가정용가위,블런트어린이가위,블런트틴닝가위,블런트유아가위,블런트안전가위,블런트스트록가위';

    $db = null;    

    if (empty($KEYWORD)) {
        throw new Exception(null, 400);
    }

    if (empty($REL_KEYWORD)) {
        throw new Exception(null, 400);
    }

    // 계정    
    $accountDb = parse_ini_file("../config/db.ini");

    require_once '../class/pdo.php';
    require_once '../api/naver/restapi.php';
    require_once '../api/naver/NaverShopping.php';
    require_once '../class/curl_async.php';

    $curlAsync = new CurlAsync();        

    $db = new Db($accountDb['DB_HOST'], $accountDb['DB_NAME'], $accountDb['DB_USER'], $accountDb['DB_PASSWORD']);    

    // 검색 키워드 정보 가져오기
    $curlAsync->$KEYWORD(array(
        'url' => 'http://localhost/api/keyword.php',        
        // 'url' => 'http://ppomzipsa.com/api/keyword.php',
        'post' => array(
            'keyword' => $KEYWORD,
        )
    ));
    
    $keywordResult = json_decode($curlAsync->$KEYWORD(), true);    

    if (!$keywordResult || !$keywordResult['id']) {
        throw new Exception(null, 400);
    }

    // 연관 키워드 모두 수집
    $allRelkeywords = @explode(',', $REL_KEYWORD);

    if (empty($allRelkeywords)) throw new Exception(null, 400);
    
    // 테스트 2개
    // $allRelkeywords = array_slice($allRelkeywords, 0, 2);        
    
    $collectRelkeywords = $allRelkeywords;
    $addRelkeywords = array();    
    $total = 0;    
        
    foreach (array_chunk($collectRelkeywords, 5) as $keywordChunk) {
        foreach ($keywordChunk as $keyword) {
            $curlAsync->$keyword(array(
                'url' => 'http://localhost/api/keyword.php',                    
                // 'url' => 'http://ppomzipsa.com/api/keyword.php',
                'post' => array(
                    'keyword' => $keyword,
                )
            ));
        }

        foreach ($keywordChunk as $keyword) {
            $colletResult = $curlAsync->$keyword();
            echo $colletResult.PHP_EOL;
            $total++;

            $colletResult = json_decode($colletResult, true);

            // 수집된 정보를 검색 키워드와 연결
            if ($colletResult['id']) {
                // 연결여부 확인
                $queryWheres = array(
                    'keywords_id = :keywords_id',
                    'keywords_rel_id = :keywords_rel_id'
                );          

                $queryParams = array(
                    'keywords_id' => $keywordResult['id'],
                    'keywords_rel_id' => $colletResult['id'],
                );

                if (!empty($queryWheres)) {
                    $queryWheres = implode(' AND ', $queryWheres);                        
                } else {
                    $queryWheres = '';
                }

                $exist = $db->single("SELECT 1 FROM keywords_rel WHERE {$queryWheres}", $queryParams);

                if (empty($exist)) {
                    $dbName = array_keys($queryParams, true);
                    $dbValues = array_map(function ($val) {
                        return ':'.$val;
                    }, $dbName);
                    $dbName = implode(',', $dbName);
                    $dbValues = implode(',', $dbValues);                        

                    $dbResult = $db->query("INSERT INTO keywords_rel ({$dbName}) VALUES({$dbValues})", $queryParams);
                }

                // echo '<pre>';
                // print_r($dbResult);                        
                // echo '</pre>';
                // exit();    
            }
        }
        
        sleep(1);
    }        
    
    $db->CloseConnection();    

    echo "[{$KEYWORD}]와 연관된 {$total}개의 키워드 수집완료.".PHP_EOL;    
} catch (Exception $e) {
    if (!empty($db)) $db->CloseConnection();
    echo $e->getCode().PHP_EOL;
    echo $e->getMessage().PHP_EOL;
}
?>